tutorials/cavityFSI/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          128;
        startFace       95232;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3840;
        startFace       95360;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       99200;
    }
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       100224;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       101248;
    }
)

// ************************************************************************* //
