tutorials/cavityFSI/fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol 	         1.0e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 4;
    nNonOrthogonalCorrectors 1;
    consistent  true;
    correctPhi  true;
    momentumPredictor true; 
    nOuterCorrectors	1;
}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}



// ************************************************************************* //
